Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetRebarGeometries Method (Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetRebarGeometries(
	bool withHooks
)
Public Function GetRebarGeometries (
	withHooks As Boolean
) As ArrayList
Parameters
withHooks
Type: System.Boolean
A parameter to determine whether the hook points should be included in the rebar geometry or not.
Return Value
Type: ArrayList
An array list that contains the RebarGeometry objects.
See Also
Reference
Reinforcement Class
GetRebarGeometries Overload
Tekla.Structures.Model Namespace